{
  "backend/main.mo": "Actor defining user profiles, conversations, authorization checks, and blob storage integration for a chat system.",
  "feature_evidence.json": "Feature evidence report linking cooking-related features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of major frontend files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML document bootstrapping the frontend app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app combining authentication, chat UI, conversation management, voice features, and export functionality.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with retries and user‑friendly toasts.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input component handling text, voice dictation, image attachments, and sending messages with modes. Manages previews, cleanup, and form submission.",
  "frontend/src/components/chat/ChatEmptyState.tsx": "Displays a welcoming empty state with example prompts and capability hints. Allows users to trigger prompts with one click.",
  "frontend/src/components/chat/ConversationThread.tsx": "Renders the chat message list with auto‑scrolling, role indicators, optional voice controls, and structured cooking-format parsing. Supports assistant and user messages with source and content formatting.",
  "frontend/src/components/chat/types.ts": "Defines types for chat messages, modes, and photo attachments. Used across chat components for consistent message structure.",
  "frontend/src/components/help/CapabilitiesDialog.tsx": "Dialog describing SuperNova’s capabilities and limitations in a scrollable layout. Shows feature lists with icons and descriptions.",
  "frontend/src/components/history/ConversationSidebar.tsx": "Sidebar listing past conversations with selection, creation, and optional export. Handles authenticated vs unauthenticated states.",
  "frontend/src/components/settings/VoiceSettingsDialog.tsx": "Dialog for choosing voice response mode with radio options and browser support warnings. Updates voice mode selection through callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useConversationHistory.ts": "Manages active conversation selection, creation, switching, and entry saving tied to user identity.",
  "frontend/src/hooks/useInformationRetrieval.ts": "Fetches and summarizes info from Wikipedia and DuckDuckGo, handling failures and cooking-specific formatting.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login flow, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for user profiles, conversations, and entries with react-query queries and mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements browser speech-to-text recording with state management and error handling.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Provides text-to-speech playback controls with support checks and error handling.",
  "frontend/src/hooks/useVoiceResponseMode.ts": "Stores and updates the user's preferred voice response mode in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base and component layers plus extensive OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, then renders App.",
  "frontend/src/utils/cooking.ts": "Detects cooking prompts and formats cooking responses, including structured extraction and a cookie fallback recipe.",
  "frontend/src/utils/downloadJson.ts": "Provides a helper to download arbitrary data as a JSON file with a timestamped default filename.",
  "frontend/src/utils/summarize.ts": "Generates a short summary from text snippets by selecting leading sentences or truncating as needed.",
  "frontend/src/utils/textCleanup.ts": "Cleans and normalizes text by stripping HTML, removing boilerplate, deduplicating lines, and trimming to sentences.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, custom colors tied to CSS variables, and UI animations.",
  "project_state.json": "Describes project metadata, existing cooking-related features, and pending accessibility-focused feature requests."
}