{
  "backend/main.mo": "Main canister logic for user profiles and multi‑conversation storage with authorization checks and CRUD operations for conversations and entries.",
  "backend/migration.mo": "Migration module that converts old single‑conversation data structures to the new multi‑conversation format with default timestamps and titles.",
  "feature_evidence.json": "Feature evidence report mapping two frontend features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files including hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication, conversation state, message flow, data export, and UI layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting first‑time users to save a profile name with validation and loading states.",
  "frontend/src/components/chat/ChatComposer.tsx": "A chat input component with text entry, voice transcription, and send handling, syncing local state with external value.",
  "frontend/src/components/chat/ChatEmptyState.tsx": "Displays an introductory empty-state screen with example prompts and feature hints.",
  "frontend/src/components/chat/ConversationThread.tsx": "Renders the chat message list with auto-scrolling, role indicators, TTS controls, and source links.",
  "frontend/src/components/help/CapabilitiesDialog.tsx": "A dialog listing SuperNova’s capabilities, limitations, and usage tips.",
  "frontend/src/components/history/ConversationSidebar.tsx": "Shows a sidebar of conversation summaries with selection, new chat, and optional data export.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useConversationHistory.ts": "Manages conversation state, listing, selection, creation, and saving of entries for authenticated users.",
  "frontend/src/hooks/useInformationRetrieval.ts": "Provides a hook that fetches summaries from Wikipedia and DuckDuckGo, compiles excerpts, and returns a combined summarized result with loading and warning states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements React context and hooks for managing Internet Identity authentication, including login, logout, and identity loading with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, conversations, entries, and data export with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Adds browser speech-to-text functionality with recording control, transcript management, and error handling.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Provides text-to-speech control through the Web Speech API, managing speech playback state and errors.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom CSS variables for light and dark themes, along with typography tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering the root component.",
  "frontend/src/utils/downloadJson.ts": "Creates and downloads a JSON file from provided data using a generated Blob and timestamped filename.",
  "frontend/src/utils/summarize.ts": "Generates a short summary from text snippets by extracting initial sentences or truncating long content.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters, falling back to sessionStorage and supporting hash-based routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, color variables, container settings, and animations.",
  "project_state.json": "Project state file tracking architecture notes, existing features, and new feature requests for conversation persistence and data export."
}