{
  "backend/main.mo": "Main Motoko actor handling user profiles, conversations, query entries with optional photo blobs, and authorization via mixins.",
  "backend/migration.mo": "Migration module converting old conversation/query-entry formats to new ones by adding a nullable photo field.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs supporting photo upload and message attachment features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all major frontend components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme overrides.",
  "frontend/index.html": "Base HTML page that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring authentication, conversation handling, information retrieval, TTS, voice settings, and photo-attached messages.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication control that handles Internet Identity login/logout with loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users to enter and save their display name with validation and loading states.",
  "frontend/src/components/chat/ChatComposer.tsx": "Provides a message composer with text, voice input, and photo attachment support, handling submission and local preview state.",
  "frontend/src/components/chat/ChatEmptyState.tsx": "Displays a welcoming empty-state view with example prompts and capability hints to start a chat.",
  "frontend/src/components/chat/ConversationThread.tsx": "Renders the chat message list with auto-scrolling, role indicators, voice playback controls, and special formatting for recipe-style content.",
  "frontend/src/components/chat/types.ts": "Defines TypeScript types for chat messages, modes, and photo attachments.",
  "frontend/src/components/help/CapabilitiesDialog.tsx": "Shows a dialog listing the assistant’s capabilities and limitations.",
  "frontend/src/components/history/ConversationSidebar.tsx": "Provides a sidebar for listing, selecting, creating, and exporting conversation histories.",
  "frontend/src/components/settings/VoiceSettingsDialog.tsx": "Dialog for choosing voice response modes and warning users if voice features are unsupported.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useConversationHistory.ts": "Manages conversation lists, active conversation state, and saving or creating conversation entries tied to user authentication.",
  "frontend/src/hooks/useInformationRetrieval.ts": "Fetches Wikipedia and DuckDuckGo results, summarizes snippets, and handles partial failures and cooking-specific formatting.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query for profiles, conversations, entries, and mutations like create, add, and delete.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements browser speech-to-text with recording control, error handling, and transcript management.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Provides text-to-speech capabilities with speak/stop controls, state tracking, and error handling.",
  "frontend/src/hooks/useVoiceResponseMode.ts": "Stores and updates the user's voice response mode in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes and UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider before rendering App.",
  "frontend/src/utils/cooking.ts": "Detects cooking-related prompts and formats structured cooking responses by extracting ingredients, steps, and tips.",
  "frontend/src/utils/downloadJson.ts": "Generates and downloads a JSON file from provided data using a Blob and temporary link.",
  "frontend/src/utils/summarize.ts": "Creates a short summary from snippets by extracting initial sentences or truncating long text.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and sessionStorage parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, container settings, and custom animations.",
  "project_state.json": "Defines current project state, including features, issues, and new feature requests for photo uploads and data export."
}