{
  "backend/main.mo": "Motoko backend defining user profiles, conversations, authorization checks, and blob-backed chat entries with strict permission gating.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of numerous frontend files and hooks.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens for the app.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app orchestrating authentication, guest mode, conversations, chat UI, information retrieval, and voice features.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button with error handling, recovery logic, and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting newly authenticated users to save a display name with validation and loading states.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input component handling text, voice dictation, photo attachments, and message submission.",
  "frontend/src/components/chat/ChatEmptyState.tsx": "Displays initial chat screen with example prompts and capability hints.",
  "frontend/src/components/chat/ConversationThread.tsx": "Renders chat messages with auto-scroll, role indicators, optional voice actions, and special cooking-format parsing.",
  "frontend/src/components/chat/types.ts": "Defines chat-related types including Message, MessageMode, and photo attachments.",
  "frontend/src/components/help/CapabilitiesDialog.tsx": "Modal dialog listing SuperNova’s capabilities and limitations.",
  "frontend/src/components/history/ConversationSidebar.tsx": "Sidebar for listing, selecting, and creating conversations with optional data export and auth gating.",
  "frontend/src/components/settings/VoiceSettingsDialog.tsx": "Dialog for choosing voice response mode with browser support warnings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useConversationHistory.ts": "Manages conversation list, active conversation selection, and saving new entries tied to the authenticated user.",
  "frontend/src/hooks/useInformationRetrieval.ts": "Fetches and summarizes information from Wikipedia and DuckDuckGo, handling partial failures and cooking‑specific formatting.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls for profiles, conversations, and entries with React Query, including mutations and cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements browser speech‑to‑text with start/stop controls, transcript accumulation, and error handling.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Provides text‑to‑speech playback with control over speaking state, error reporting, and cleanup.",
  "frontend/src/hooks/useVoiceResponseMode.ts": "Stores and retrieves the user's preferred voice response mode using localStorage.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying base styling to body and prose elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders the root component.",
  "frontend/src/utils/cooking.ts": "Detects cooking-related prompts and formats cooking responses by extracting ingredients, steps, and tips from text snippets.",
  "frontend/src/utils/downloadJson.ts": "Creates and downloads a JSON file from provided data using a generated blob and timestamped filename.",
  "frontend/src/utils/summarize.ts": "Builds a short summary from text snippets by extracting the first few sentences or falling back to truncated content.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography plugins, theme extensions, and animations based on CSS variables.",
  "project_state.json": "Describes project state, issues, and feature requirements focused on fixing login flow and enabling guest mode."
}