{
  "kind": "build_request",
  "title": "Add photo upload option to chat composer and persist uploaded photos in conversation history",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a visible photo-upload control to the chat composer that lets a user select one or more images (PNG/JPG/WebP), shows previews of the selected images, and allows removing an image before sending.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I dont see the option to upload photots"
        ]
      },
      "acceptanceCriteria": [
        "ChatComposer shows an attachment/upload button next to the existing composer controls.",
        "Clicking the button opens a file picker limited to common image formats (png, jpg/jpeg, webp).",
        "After selection, the composer shows thumbnail previews for each selected image.",
        "Each selected image can be removed before sending.",
        "Sending a message clears the selected images from the composer state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Support sending chat messages with optional uploaded photos, rendering the photos inline in the conversation thread for the corresponding user message (and when loading conversation history).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I dont see the option to upload photots"
        ]
      },
      "acceptanceCriteria": [
        "When a user sends a message with photos attached, the new user message in the thread renders the photo(s) inline (e.g., above or below the text).",
        "When switching conversations or reloading the app, previously sent messages still show their uploaded photos.",
        "Assistant messages do not require photo attachments, but the UI remains stable if attachments are absent."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the backend conversation entry model and API to store optional photo attachments per query entry, and update frontend query hooks to use the updated API when saving and fetching conversation entries.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I dont see the option to upload photots"
        ]
      },
      "acceptanceCriteria": [
        "Backend QueryEntry type includes an optional list of photo attachments (including at least bytes and content-type, plus a filename field if available).",
        "Backend addQueryEntry (or a new compatible method) accepts optional photo attachments and persists them with the entry.",
        "Frontend hooks that save entries (useAddQueryEntry/useConversationHistory.saveEntry) can include attachments when present and still work when no attachments are provided.",
        "Fetched conversation entries expose attachments to the frontend so they can be rendered in the thread."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Include uploaded photos in the existing user data export so exported conversation history contains the photo attachment data for each entry that has them.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I dont see the option to upload photots"
        ]
      },
      "acceptanceCriteria": [
        "exportUserData output includes photo attachment data for entries that have photos.",
        "Export still works for users with no photos and for existing conversations created before this change."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose them instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an upgrade requires state migration."
  ],
  "nonGoals": [
    "Do not implement AI/image understanding, OCR, or any automated photo analysis.",
    "Do not integrate third-party file storage/CDNs or external databases.",
    "Do not add non-Internet-Identity authentication methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}