{
  "kind": "build_request",
  "title": "Fix login flow and enable guest usage when Internet Identity is unavailable",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent unauthenticated users from hitting authenticated backend methods by gating React Query hooks on Internet Identity authentication state, so the app works in anonymous/guest mode without backend traps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "this shits not working properly I need to be able to login or use automatically"
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, the app does not call backend methods that require user permissions (e.g., getCallerUserProfile, listConversations, getConversationEntries, exportUserData) and does not show uncaught errors due to backend authorization traps.",
        "When logged in, all existing authenticated queries and mutations still work (profile, conversation history, saving entries, export).",
        "React Query does not repeatedly retry unauthorized calls in the background when the user is not authenticated."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a first-class guest mode UX that lets users keep chatting without logging in, while clearly communicating that history/export/saving require login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I need to be able to login or use automatically"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users can continue sending messages beyond the current limit without being blocked by the composer disabled state.",
        "The UI clearly labels the session as Guest when not authenticated, and indicates which features require login (history sidebar, saving conversation, exporting data).",
        "If a guest user logs in mid-session, the current on-screen chat remains usable (no blank screen / no crash), and the app continues with authenticated features available."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve login reliability and user-facing error reporting in the header login control so failed login attempts provide actionable feedback and recovery options.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "this shits not working properly I need to be able to login or use automatically"
        ]
      },
      "acceptanceCriteria": [
        "If Internet Identity login fails (including the \"User is already authenticated\" path), the user sees an English error message (toast and/or inline) with a clear next step (e.g., retry login, logout then login).",
        "The login button shows a stable loading state during login and returns to an appropriate idle state afterward.",
        "No infinite login/logout loop occurs when the hook reports \"User is already authenticated\"."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/*.",
    "Backend must remain a single Motoko actor in backend/main.mo."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding an external database or any non-IC persistence for guest data beyond local browser storage.",
    "Building real-time features (websockets/chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}