{
  "kind": "build_request",
  "title": "Improve cooking answers to be maximally helpful and easy to understand (e.g., baking cookies)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When the user asks a cooking question (e.g., \"how to bake cookies\"), generate a structured, plain-English answer that is maximally helpful for a broad audience, using clear sections and step-by-step instructions rather than returning raw or loosely extracted snippets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "yes when I ask how to bake cookies I want it to respond in the smartest way it can you anyone to understand"
        ]
      },
      "acceptanceCriteria": [
        "For the prompt \"How do I bake cookies?\", the assistant response includes clearly labeled sections using the existing rendering convention (e.g., **Ingredients:**, **Steps:**, **Tips:**).",
        "The \"Steps\" section is output as an ordered list with short, concrete steps (one action per step where possible).",
        "The answer includes key cookie-baking specifics in plain language (at minimum: oven temperature guidance, approximate bake time range, and doneness cues), without requiring the user to read the linked sources.",
        "If information retrieval snippets do not contain cleanly extractable ingredients/steps, the app still produces a helpful cookie-baking guide instead of falling back to an unstructured excerpt."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance the cooking-response formatter so that extracted content is cleaned and normalized for readability (remove partial keyword context, avoid mid-sentence clipping, and avoid duplicating boilerplate), while preserving the existing ConversationThread structured-cooking rendering behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "yes when I ask how to bake cookies I want it to respond in the smartest way it can you anyone to understand"
        ]
      },
      "acceptanceCriteria": [
        "Cooking answers do not include truncated fragments like partial words/HTML artifacts, and do not include large verbatim blocks when structured output is available.",
        "The output continues to use the same section markers that ConversationThread.tsx already detects (e.g., '**Ingredients:**' and '**Steps:**'), so the UI renders sections correctly.",
        "For cooking prompts, the response remains understandable even if only one source returns results (partial failure)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify immutable authentication/actor hooks paths listed in SYSTEM_CONTEXT (compose them instead).",
    "Backend remains single-actor (all Motoko logic in backend/main.mo); no new backend services."
  ],
  "nonGoals": [
    "Adding new third-party LLM integrations or external AI services.",
    "Implementing new real-time features (e.g., WebSockets/chat).",
    "Changing Internet Identity authentication behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}