{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve structured cooking answers and snippet cleanup",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Generate a structured, plain-English cooking guide (with Ingredients/Steps/Tips) and robust cookie-baking fallback when retrieval text is not cleanly extractable.",
      "acceptanceCriteria": [
        "For the prompt \"How do I bake cookies?\", the assistant response includes clearly labeled sections using the existing rendering convention (e.g., **Ingredients:**, **Steps:**, **Tips:**).",
        "The \"Steps\" section is output as an ordered list with short, concrete steps (one action per step where possible).",
        "The answer includes key cookie-baking specifics in plain language (at minimum: oven temperature guidance, approximate bake time range, and doneness cues), without requiring the user to read the linked sources.",
        "If information retrieval snippets do not contain cleanly extractable ingredients/steps, the app still produces a helpful cookie-baking guide instead of falling back to an unstructured excerpt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/cooking.ts",
          "operation": "modify",
          "description": "Revise formatCookingResponse to always produce structured output for cooking prompts (using **Ingredients:**/**Steps:**/**Tips:** section markers that ConversationThread.tsx already recognizes). Add a cookie-baking-specific fallback template for queries about cookies that includes oven temperature guidance, bake time range, and doneness cues; ensure Steps are emitted as an ordered list with one action per step where possible."
        },
        {
          "path": "frontend/src/hooks/useInformationRetrieval.ts",
          "operation": "modify",
          "description": "Ensure cooking prompts reliably route through the improved formatCookingResponse and that cooking responses remain structured even when retrieval is sparse (e.g., only one source succeeds), without changing the existing ConversationThread structured-cooking rendering behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Clean and normalize retrieved cooking text to remove truncation artifacts, clipped fragments, and boilerplate duplication while preserving ConversationThread section-marker parsing.",
      "acceptanceCriteria": [
        "Cooking answers do not include truncated fragments like partial words/HTML artifacts, and do not include large verbatim blocks when structured output is available.",
        "The output continues to use the same section markers that ConversationThread.tsx already detects (e.g., '**Ingredients:**' and '**Steps:**'), so the UI renders sections correctly.",
        "For cooking prompts, the response remains understandable even if only one source returns results (partial failure)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/textCleanup.ts",
          "operation": "create",
          "description": "Add small, reusable text-cleanup utilities for retrieval snippets (e.g., stripping HTML artifacts, normalizing whitespace/punctuation, removing repeated boilerplate lines, and trimming to sentence boundaries to avoid mid-sentence clipping)."
        },
        {
          "path": "frontend/src/utils/cooking.ts",
          "operation": "modify",
          "description": "Integrate text cleanup/normalization into the cooking formatter: pre-clean snippets before combining, deduplicate near-identical lines, avoid returning large verbatim blocks, and improve section extraction so Ingredients/Steps/Tips are readable (no partial keyword context) while keeping the exact section markers expected by ConversationThread.tsx."
        }
      ]
    }
  ]
}